# Add one row in an existing Pandas DataFrame

In [1]:
import pandas as pd

In [3]:
Mark = {'Name' : ['Harish','Rakshitha','Manohar','Vidya'],
       'Maths' : [87,98,87,95],
       'IT Skills' : [83,99,84,76]}
df = pd.DataFrame(Mark)
df

        Name  Maths  IT Skills
0     Harish     87         83
1  Rakshitha     98         99
2    Manohar     87         84
3      Vidya     95         76

In [5]:
df.loc[len(df.index)] = ['Hruthik',89,96]
df1 = df
df

        Name  Maths  IT Skills
0     Harish     87         83
1  Rakshitha     98         99
2    Manohar     87         84
3      Vidya     95         76
4    Hruthik     89         96
5    Hruthik     89         96

In [6]:
df.loc[2] = ['Hruthik',89,96]
df

        Name  Maths  IT Skills
0     Harish     87         83
1  Rakshitha     98         99
2    Hruthik     89         96
3      Vidya     95         76
4    Hruthik     89         96
5    Hruthik     89         96